### DataFrame

In [2]:
import pandas as pd
# DataFrame 객체생성
# 1. object 에 동일한 길이의 리스트를 값으로 가지는 딕셔너리 사용
obj={'이름':['이유리','최민준','김민지'],
'전공':['경영학과','컴퓨터공학과','데이터과학과'],
'성별':['여','남','여'],
'나이':[20,22,21]
}

In [3]:
df_1=pd.DataFrame(obj)  # 데이터프레임 생성
df_1

    이름      전공 성별  나이
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21

In [5]:
import numpy as np
# 2. object에 2차원 배열 이용
obj=np.array([['이유리','경영학과','여',20],
              ['최민준','컴퓨터공학과','남',22],
              ['김민지','데이터과학과','여',21]])

df_2=pd.DataFrame(obj)
df_2

     0       1  2   3
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21

In [6]:
# 3. 원하는 인덱스 생성
df_3=pd.DataFrame(obj,
                  columns=['Name','Major','Sex','Age'],
                  index=['A','B','C'])

df_3

  Name   Major Sex Age
A  이유리    경영학과   여  20
B  최민준  컴퓨터공학과   남  22
C  김민지  데이터과학과   여  21

In [7]:
# 데이터프레임 정보 확인 메소드
# DataFrame객체 생성
obj={'Name':['Olivia','Lucas','Sophia','Zoe','Ava','Elliot'],
     'Sex':['Female','Male','Female','Female','Female','Male'],
     'Age':[22,32,27,18,38,19]}
df=pd.DataFrame(obj)    # 데이터프레임 생성
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [8]:
# .values
# 데이터프레임 내 값을 배열 형태로 반환
print(df.values)

[['Olivia' 'Female' 22]
 ['Lucas' 'Male' 32]
 ['Sophia' 'Female' 27]
 ['Zoe' 'Female' 18]
 ['Ava' 'Female' 38]
 ['Elliot' 'Male' 19]]

In [9]:
# .index
# 데이터프레임 내 행 인덱스를 레이블 형태로 반환
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [10]:
# .columns
# 데이터프레임 내 열 인덱스를 레이블 배열 형태로 반환
print(df.columns)

Index(['Name', 'Sex', 'Age'], dtype='object')

In [11]:
# .dtypes
# 데이터프레임 내 변수(컬럼)별 데이터 타입 확인
print(df.dtypes)

Name    object
Sex     object
Age      int64
dtype: object

In [13]:
# .shape
# 데이터프레임의 행, 열 길이 확인
print(df.shape)

(6, 3)

In [14]:
# .info()
# 데이터프레임의 전반적인 요약 정보 확인
# 로우명, 컬럼명, 행길이, 열길이, 컬럼별 데이터타입, 메모리등 확인가능
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Sex     6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [15]:
# .head(n=5)
# 데이터프레임의 상위 행을 반환 (n은 반환할 행의 수)
df.head()

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38

In [16]:
df.head(1)

     Name     Sex  Age
0  Olivia  Female   22

In [17]:
df.head(-3) # 전체-3 개의 상위 행 반환

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27

In [18]:
# .tail(n=5)
# 데이터프레임의 하위 행을 반환(n은 반환할 행으 ㅣ수)
df.tail()

     Name     Sex  Age
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [19]:
df.tail(1)

     Name   Sex  Age
5  Elliot  Male   19

In [20]:
df.tail(-3)

     Name     Sex  Age
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [30]:
# 열만 참조
# 데이터프레임명['컬럼명']
idx=list('abcdef')
df=pd.DataFrame(obj,index=idx)
df['Name']

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [31]:
# 데이터프레임명.컬럼명
df.Name

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [32]:
# 여러 열을 추출
# 데이터프레밍명[리스트]
colnm=['Name','Age']
df[colnm]

     Name  Age
a  Olivia   22
b   Lucas   32
c  Sophia   27
d     Zoe   18
e     Ava   38
f  Elliot   19

In [33]:
# 행만 참조
# iloc[위치기반]
df.iloc[1]

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [34]:
# 2~5번쨰
df.iloc[1:5]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [35]:
# 연속하지 않은 위치일 경우에도 리스트로 행을 참조
idx=[1,3]
df.iloc[idx]

    Name     Sex  Age
b  Lucas    Male   32
d    Zoe  Female   18

In [ ]:
# loc은 레이블 기반, 데이터프레임명.loc[행레이블인덱스]
# 2번째 행의 값과 원래 컬럼명을 레이블 인덱스로 가지는 시리즈
df.loc['b']

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [37]:
# 2~5번쨰 행을 가지는 프레임
df.loc['b':'e']

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [38]:
df['Age']

a    22
b    32
c    27
d    18
e    38
f    19
Name: Age, dtype: int64

In [40]:
df['Age']['a']

22

In [41]:
df['Age'][0]

22

In [42]:
# case4 : 여러 열을 참조하는법
# 1. iloc 사용
df.iloc[1:4,1:]

      Sex  Age
b    Male   32
c  Female   27
d  Female   18

In [43]:
# 2. loc 사용
df.loc['b','Name']

'Lucas'

In [44]:
rownm=['b','d','e']
colnm=['Name','Sex']
df.loc[rownm,colnm]

    Name     Sex
b  Lucas    Male
d    Zoe  Female
e    Ava  Female

In [47]:
df['Score']=[100,95,60,77,83,84]

In [48]:
df.describe()   #컬럼별 요약 통계량 (float.int인 경우만)

             Age       Score
count   6.000000    6.000000
mean   26.000000   83.166667
std     7.874008   14.133884
min    18.000000   60.000000
25%    19.750000   78.500000
50%    24.500000   83.500000
75%    30.750000   92.250000
max    38.000000  100.000000